Data/TestFiles/cases/LESStep/case/0/k
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{

    constraint
    {
        type        symmetry;
        value       $internalField;
    }

    wall
    {
        type        symmetry;
        value       $internalField;
    }

    wall001
    {
        type        kqRWallFunction;
        value       $internalField;
    }

    inlet
    {
        type        fixedValue;
        value       uniform 0.15;
    }

    outlet
    {
        type        inletOutlet;
        inletValue  $internalField;
        value       $internalField;
    }

    defaultFaces
    {
        type        zeroGradient;
    }

}

// ************************************************************************* //
